# ModelCurveArrArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArrArray Constructor
ModelCurveArrArray Class See Also
---
Initializes a new instance of the ModelCurveArrArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ModelCurveArrArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ModelCurveArrArray()
```

# See Also
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace